IRP/src/InformationRegisters/LockDataModificationRules/LockDataModificationRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>LockDataModificationRules</name>
 <resources>
  <name>Attribute</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>64</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>ComparisonType</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>Value</name>
  <type>
   <types>Boolean</types>
   <types>String</types>
   <types>Date</types>
   <types>Number</types>
   <types>AnyRef</types>
   <numberQualifiers>
    <precision>10</precision>
    <scale>5</scale>
   </numberQualifiers>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>DisableRule</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>TableName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>SetValueAsCode</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>LockDataModificationReasons</name>
  <type>
   <types>CatalogRef.LockDataModificationReasons</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Type</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>256</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>Number</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/LockDataModificationServer/Module.bsl
#Region EventSubscriptions

Procedure BeforeWrite_DocumentsLockDataModification(Source, Cancel, WriteMode, PostingMode) Export
	SourceParams = New Structure;
	Array = New Array;
	Array.Add(Source);
	SourceParams.Insert("Source", Array);
	SourceParams.Insert("isNew", Source.IsNew());
	SourceParams.Insert("MetadataName", Source.Metadata().FullName());
	If Constants.UseLockDataModification.Get() And SourceisLocked(SourceParams) Then
		Cancel = True;
	EndIf;
EndProcedure

Procedure BeforeWrite_CatalogsLockDataModification(Source, Cancel, WriteMode, PostingMode) Export
	SourceParams = New Structure;
	Array = New Array;
	Array.Add(Source);
	SourceParams.Insert("Source", Array);
	SourceParams.Insert("isNew", Source.IsNew());
	SourceParams.Insert("MetadataName", Source.Metadata().FullName());
	If Constants.UseLockDataModification.Get() And SourceisLocked(SourceParams) Then
		Cancel = True;
	EndIf;
EndProcedure

Procedure BeforeWrite_InformationRegistersLockDataModification(Source, Cancel, Replacing) Export
	SourceParams = New Structure;
	SourceParams.Insert("Source", Source);
	SourceParams.Insert("isNew", True);
	SourceParams.Insert("MetadataName", Source.Metadata().FullName());	
	If Constants.UseLockDataModification.Get() And SourceisLocked(SourceParams) Then
		Cancel = True;
	EndIf;
EndProcedure

Procedure BeforeWrite_AccumulationRegistersLockDataModification(Source, Cancel, Replacing) Export
	SourceParams = New Structure;
	SourceParams.Insert("Source", Source);
	SourceParams.Insert("isNew", True);
	SourceParams.Insert("MetadataName", Source.Metadata().FullName());
	If Constants.UseLockDataModification.Get() And SourceisLocked(SourceParams) Then
		Cancel = True;
	EndIf;
EndProcedure

#EndRegion

#Region Privat

Function SourceisLocked(Val SourceParams)
	Rules = CalculateRuleByObject(SourceParams);
	If Rules = Undefined Then
		Return False;
	EndIf;
	
	Return SourceLockedByRules(SourceParams, Rules);
EndFunction

Function CalculateRuleByObject(SourceParams, AddInfo = Undefined)
	Query = New Query;
	Query.Text =
		"SELECT
		|	LockDataModificationRules.Attribute,
		|	LockDataModificationRules.ComparisonType,
		|	LockDataModificationRules.Value
		|FROM
		|	InformationRegister.LockDataModificationRules AS LockDataModificationRules
		|WHERE
		|	LockDataModificationRules.Type = &MetadataName";
	
	Query.SetParameter("MetadataName", SourceParams.MetadataName);
	
	QueryResult = Query.Execute();
	If QueryResult.IsEmpty() Then
		Return Undefined;
	EndIf;
	Return QueryResult.Unload();
EndFunction

Function SourceLockedByRules(SourceParams, Rules, AddInfo = Undefined)
	
	Text = New Array;
	
	Query = New Query;
	For Index = 0 To Rules.Count() - 1 Do
		For AddIndex = 0 To SourceParams.Source.Count() - 1 Do
			Text.Add("&SourceParam" + Index + AddIndex + " " + Rules[Index].ComparisonType + " (" + "&Param" + Index + ")");
		EndDo;
		Query.SetParameter("Param" + Index, Rules[Index].Value);
	EndDo;
	Query.Text = "SELECT True WHERE " + StrConcat(Text, " AND ");
		
	If Not SourceParams.isNew Then
		For Index = 0 To Rules.Count() - 1 Do
			Attribute = StrSplit(Rules[Index].Attribute, ".")[1];
			For AddIndex = 0 To SourceParams.Source.Count() - 1 Do
				Query.SetParameter("SourceParam" + Index + AddIndex, SourceParams.Source[AddIndex].Ref[Attribute]);
			EndDo;
		EndDo;
		QueryResult = Query.Execute();
		If Not QueryResult.IsEmpty() Then
			Return True;
		EndIf;
	EndIf;
	For Index = 0 To Rules.Count() - 1 Do
		Attribute = StrSplit(Rules[Index].Attribute, ".")[1];
		For AddIndex = 0 To SourceParams.Source.Count() - 1 Do
			Query.SetParameter("SourceParam" + Index + AddIndex, SourceParams.Source[AddIndex][Attribute]);
		EndDo;
		
	EndDo;
	Return Not Query.Execute().IsEmpty();
EndFunction
#EndRegion
